## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.networking.azurerm_subnet.aks_subnet will be created
  + resource "azurerm_subnet" "aks_subnet" {
      + address_prefixes                              = [
          + "10.10.0.0/24",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "subnet-rg-stirling-prod"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rg-stirling-prod"
      + virtual_network_name                          = "aks_vnet-rg-stirling-prod"
    }

  # module.networking.azurerm_subnet.load_balancer_subnet will be created
  + resource "azurerm_subnet" "load_balancer_subnet" {
      + address_prefixes                              = [
          + "10.10.1.0/24",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "subnet-Loadbalancer-rg-stirling-prod"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rg-stirling-prod"
      + virtual_network_name                          = "aks_vnet-rg-stirling-prod"
    }

  # module.networking.azurerm_virtual_network.aks_vnet will be created
  + resource "azurerm_virtual_network" "aks_vnet" {
      + address_space                  = [
          + "10.10.0.0/16",
        ]
      + dns_servers                    = (known after apply)
      + guid                           = (known after apply)
      + id                             = (known after apply)
      + location                       = "polandcentral"
      + name                           = "aks_vnet-rg-stirling-prod"
      + private_endpoint_vnet_policies = "Disabled"
      + resource_group_name            = "rg-stirling-prod"
      + subnet                         = (known after apply)
      + tags                           = {
          + "environment" = "prod"
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```
</details>